# -*- coding: utf-8 -*-
"""Copy of 2.3. Домашняя работа

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1Dim5URr-j1n9E7XMf63toiOzDl4n-YGQ

**Навигация по уроку**

1. [Введение в Python. Синтаксис](https://colab.research.google.com/drive/1YBLgd6tZYlkhwpnEc4IM8tVnewLUnlUO#scrollTo=yqZjRAldfz_L)
2. [Практика](https://colab.research.google.com/drive/1m-Ph90c-9S_gZchdG1ARoY2YjMTryKkl#scrollTo=UdxWiGmA63K2)
3. Домашняя работа

В домашней работе необходимо, используя знания теоретической части занятия и полученные практические навыки, решить, представленные ниже задачи. Для этого необходимо скопировать Блокнот (см. раздел 1.1.), решить в нем все задач, открыть общий доступ к Блокноту ((см. раздел 1.1.) и отправить ссылку на Блокнот куратору на проверку. Желаем удачи!

## Задача 1. Приветствие.

**Условие.** Напишите программу, запрашивающую у пользователя его имя. В ответ
на ввод на экране должно появиться приветствие с обращением по имени,
введенному с клавиатуры ранее.
"""

#Напишите свое решение
# Запрос имени пользователя
имя = input("Пожалуйста, введите ваше имя: ")

# Вывод приветствия с обращением по имени
print(f"Привет, {имя}! Добро пожаловать!")

"""## Задача 2. Сувениры и безделушки.

**Условие.** Интернет-магазин занимается продажей различных сувениров и безделушек. Каждый сувенир весит 75 г, а безделушка – 112 г. Напишите программу, запрашивающую у пользователя количество тех и других покупок,
после чего выведите на экран общий вес посылки.
"""

#Напишите свое решение
# Запрос количества сувениров и безделушек
количество_сувениров = int(input("Введите количество сувениров: "))
количество_безделушек = int(input("Введите количество безделушек: "))

# Вес сувениров и безделушек
вес_сувенира = 75  # граммы
вес_безделушки = 112  # граммы

# Рассчитываем общий вес посылки
общий_вес = (количество_сувениров * вес_сувенира) + (количество_безделушек * вес_безделушки)

# Выводим общий вес
print(f"Общий вес посылки составляет {общий_вес} грамм.")

"""## Задача 3. Сложные проценты

**Условие.** Представьте, что вы открыли в банке сберегательный счет под 4 % годовых. Проценты банк рассчитывает в конце года и добавляет к сумме счета.
Напишите программу, которая запрашивает у пользователя сумму первоначального депозита, после чего рассчитывает и выводит на экран сумму
на счету в конце первого, второго и третьего годов. Все суммы должны
быть округлены до двух знаков после запятой.
"""

#Напишите свое решение
# Запрос суммы первоначального депозита
initial_deposit = float(input("Введите сумму первоначального депозита: "))

# Годовая процентная ставка
annual_interest_rate = 0.04  # 4% в год

# Рассчитываем сумму на счету в конце первого, второго и третьего года
balance_year1 = initial_deposit * (1 + annual_interest_rate)
balance_year2 = balance_year1 * (1 + annual_interest_rate)
balance_year3 = balance_year2 * (1 + annual_interest_rate)

# Округляем суммы до двух знаков после запятой
balance_year1 = round(balance_year1, 2)
balance_year2 = round(balance_year2, 2)
balance_year3 = round(balance_year3, 2)

# Выводим суммы на счету
print(f"Сумма на счету в конце первого года: RUB {balance_year1}")
print(f"Сумма на счету в конце второго года: RUB {balance_year2}")
print(f"Сумма на счету в конце третьего года: RUB {balance_year3}")

def recursive_percents(initial_deposit, annual_interest_rate, year):
  if (year == 1) :
    return initial_deposit * (1 + annual_interest_rate)
  else:
    previous_result_balance = recursive_percents(initial_deposit, annual_interest_rate, year - 1)
    return previous_result_balance * (1 + annual_interest_rate)
print(f"Сумма на счету в конце первого года: RUB {recursive_percents(initial_deposit, annual_interest_rate, year = 1)}")
print(f"Сумма на счету в конце второго года: RUB {recursive_percents(initial_deposit, annual_interest_rate, year = 2)}")
print(f"Сумма на счету в конце третьего года: RUB {recursive_percents(initial_deposit, annual_interest_rate, year = 3)}")


def cycle_rate_calc(initial_deposit, annual_interest_rate, year):
  index = 0
  result = initial_deposit
  while(index < year) :
    result = result * (1 + annual_interest_rate)
    index = index + 1
  return result

print(f"Сумма на счету в конце первого года: RUB {cycle_rate_calc(initial_deposit, annual_interest_rate, year = 1)}")
print(f"Сумма на счету в конце второго года: RUB {cycle_rate_calc(initial_deposit, annual_interest_rate, year = 2)}")
print(f"Сумма на счету в конце третьего года: RUB {cycle_rate_calc(initial_deposit, annual_interest_rate, year = 3)}")

"""## Задача 4. Арифметика

**Условие.** Создайте программу, которая запрашивает у пользователя два целых числа a и b, после чего выводит на экран результаты следующих математических операций:
* сумма a и b;
* разница между a и b;
* произведение a и b;
* частное от деления a на b;
* остаток от деления a на b;
* десятичный логарифм числа a;
* результат возведения числа a в степень b.
"""

#Напишите свое решение
import math

a = int(input("Введите ваше значение для а: "))
b = int(input("Введите ваше значение для b: "))

def sum(a, b):
  return a + b
def difference(a, b):
  return a - b
def multiple(a, b):
  return a * b
def quotient(a, b):
  return a / b
def remainder(a, b):
  return a % b
def logarithm(a):
  return math.log10(abs(a))
def power(x, y):
    if(y == 0):
        return 1
    temp = power(x, int(y / 2))

    if (y % 2 == 0):
        return temp * temp
    else:
        if(y > 0):
            return x * temp * temp
        else:
            return (temp * temp) / x

print(f"Сумма a и b: {sum(a,b)}")
print(f"Разница между a и b: {difference(a, b)}")
print(f"Произведение a и b: {multiple(a,b)}")
print(f"Частное от деления a на b: {quotient(a,b)}")
print(f"Остаток от деления a на b: {remainder(a,b)}")
print(f"Десятичный логарифм числа a: {logarithm(a)}")
print(f"Результат возведения числа a в степень b: {power(a,b)}")

"""## Задача 5. Размен

**Условие.** Представьте, что вы пишете программное обеспечение для автоматической кассы в  магазине самообслуживания. Одной из функций, заложенных в кассу, должен быть расчет сдачи в случае оплаты покупателем наличными.
Напишите программу, которая будет запрашивать у пользователя сумму сдачи в копейках. После этого она должна рассчитать и вывести на экран, сколько и каких монет потребуется для выдачи указанной суммы, при условии что должно быть задействовано минимально возможное количество монет. Допустим, у нас есть в распоряжении монеты достоинством в 1, 5, 10, 50 копеек, а также в 1, 2 и 5 рублей.
"""

#Напишите свое решение
def give_change(change_in_kopecks):
    denominations = [500, 200, 100, 50, 10, 5, 1]
    names = ['5 руб', '2 руб', '1 руб', '50 копеек', '10 копеек', '5 копеек', '1 копеек']
    change = {name: 0 for name in names}
    change_in_kopecks += (change.get('5 руб', 0) * 500) + (change.get('2 руб', 0) * 200) + (change.get('1 руб', 0) * 100)
    for i in range(len(denominations)):
        denomination = denominations[i]
        name = names[i]
        #выбираем самые большие номиналы
        while change_in_kopecks >= denomination:
            change[name] += 1
            change_in_kopecks -= denomination

    return change

# Запросить у пользователя сумму изменения в копейках
change_input = float(input("Введите сумму сдачи через точку в копейках  в формате РУБЛИ.КОПЕЙКИ: "))
def input_processing(input):
  return input * 100

# Вызовите функцию, чтобы дать сдачу
change = give_change(input_processing(change_input))

# Отображение результата
print("Чтобы сдать сдачу, вам понадобится:")
for name, quantity in change.items():
    if quantity > 0:
        print(f"{quantity} x {name}")

"""## Задача 6. Вчерашний хлеб

**Условие.** Пекарня продает хлеб по 49 рублей за буханку. Скидка на вчерашний хлеб составляет 60 %. Напишите программу, которая будет запрашивать у пользователя количество приобретенных вчерашних буханок хлеба. В вывод на экран должны быть включены обычная цена за буханку, цена со скидкой и общая стоимость приобретенного хлеба. Все значения должны быть выведены на отдельных строках с соответствующими описаниями. Используйте для вывода формат с двумя знаками после запятой и выровненным разделителем.
"""

#Напишите свое решение
# Стоимость одной буханки хлеба
bread_price = 49  # в рублях

# Скидка на вчерашний хлеб (в процентах)
discount = 60

# Запрос количества вчерашних буханок у пользователя
num_loaves = int(input("Введите количество вчерашних буханок хлеба: "))

# Рассчет цены со скидкой
price_with_discount = bread_price * (1 - discount / 100)

# Рассчет общей стоимости
total_cost = num_loaves * price_with_discount

# Вывод результатов
print(f"Обычная цена за буханку: {bread_price:.2f} руб.")
print(f"Цена со скидкой: {price_with_discount:.2f} руб.")
print(f"Общая стоимость: {total_cost:.2f} руб.")